<?php

    // for문을 활용해서 1~100을 더한 값을 구하시오.
    //더한 값을 출력하세요.

    $s = 0;
    for ( $i=0; $i <= 100; $i++)
    {
        $s = $i + $s; 
    }
    print $s;
    
?>

<!-- 


// 선생님 풀이.

$sum = 0;
//1~3까지 더한 값.
// 1+2+3 = 6

$sum = $sum+1;
$sum = 0+1;
$sum = $sum+2;
$sum = 1+2;
$sum = $sum+3;
$sum = 3+3;
print $sum;

------ 풀이가 저렇게 진행이 되니까, 1~100을 더한 결과.

$sum = 0;
for ($i=1l $i<=100; $i++)
{
    // $sum = $sum+$i; 같은 식.
    $sum += $i;
}
//만약  식에 ++없으면 아래처럼 사용해도 됨.
 for ($i=1l $i<=100;)
{
    $sum += $i++;
}

print $sum;

 -->